<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"fef98484ff5cd1a11152c271cdcd781be84aece2770b922217f4b36f1c130f13","plan_job_ref":"Job Test terraform-refresh #53 at https://github.com/dflook/terraform-github-actions/actions/runs/15541952677","plan_out_hash":"1548e818ed0d9be9f15daec93e747a54f4bb97682459d1da965e25f2d1d90bb8","plan_hash":"8c610738c0e3435fd87fb5fe97f801a850155bce647c219adaef05621b46bc99","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #53](https://github.com/dflook/terraform-github-actions/actions/runs/15541952677)